group_name = "БСБО-51-25"
updated_rules_date = "27.11.25"
commands_list      = f"/start 🚀: запуск бота\n/help ❓:  хелп меню\n/src 🔓:     репозиторий бота(open source)\n/rules 📜: вывод правил очереди\n\n/queue <sub>: проверить очередь по предмету <sub>(доступны \"орг\", \"история\" в любом регистре)\n/join <sub>:  присоединиться к очереди по предмету <sub>(доступны \"орг\", \"история\" в любом регистре)\n/done <sub>: выход из очереди по предмету <sub>(доступны \"орг\", \"история\" в любом регистре)"
contributers       = ", ".join(["Богатырев"])
src_rep            = "https://github.com/prilter/queue" 
rules              = f"Все правила соответствуют договоренностям с {updated_rules_date}\n\nПравило 1:\n Запуск очереди происходит за 3 часа до начала занятия\n\n Правило 2:\n Занять очередь можно только для 1 выступления, то есть каждый пользователь может быть записан в очередь только до 1 раза, пока это значение не изменится\n\n Правило 3:\n Если очередь не заканчивается, то она просто переносится на следующий раз"

history_not = "🔔 Напоминание про историю!\n\nПроверь очередь: /queue история"
org_not     = "🔔 Напоминание про ОРГ!    \n\nПроверь очередь: /queue орг"
limit_mes   = "Простите, но вы превысили лимит в 3 записи. Ознакомьтесь с правилами(/rules)"
locked_auth = "❌Очередь закрыта!"

no_args = "Нет аргументов к команде. Используйте /help, чтобы узнать правильный способ использования"
cannot_recognize = "Не удается распознать аргумент/команду. Проверьте через /help допустимые аргументы у данной команды"

# LOGS
adding_user_log         = "User was added to"
adding_user_err_log     = "Cannot add user to"
sending_mes_log         = "Sended message to user"
sending_mes_err_log     = "Cannot send message"
entries_limit_log       = "User tried to join to queue more than 1 time"
time_limit_log          = "User tried to join before opening queue"
del_user_from_queue_log = "User was deleted from queue cause he is done his presentation"
